dan99git/esp-thread-br/examples/building_os_border_router/sdkconfig.defaults
# Building OS Border Router firmware defaults
# Target: Espressif ESP Thread BR-Zigbee GW main board + Sub-Ethernet daughter board.
# See docs/08.8-border-router.md section 2.

# ESP-IDF v5.5.2 (matching upstream esp-thread-br v1.3)
CONFIG_IDF_TARGET="esp32s3"

# Native USB Serial/JTAG console on the S3.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n

# Custom partition table with ledger_a and ledger_b slots.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# General runtime tuning.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y
CONFIG_FREERTOS_HZ=1000
CONFIG_NVS_ENCRYPTION=n
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# 24K: bos_diagnostics phonebook load nests two ~5KB bos_phonebook_t on the main task at boot; 6144 overflowed -> TCB corruption -> ISR notify assert (2026-06-15)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=24576
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3584
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
# 0.1.18: BR phonebook ingest + /bos/trigger phonebook ML-EID resolver (2026-06-14)
# 0.1.19: phonebook v2 acceptance + floating book + bos_time + mDNS gateway discovery + EUI-64 device_id (2026-07-02)
# 0.1.20: confirm-gated POST /bos/device-id/reset - erases the NVS bos_reg/device_id override so boot re-derives the EUI-64 id (2026-07-02)
# 0.1.21: device-id reset also erases bos_reg/device_token so the BR re-claims under the new id (0.1.20 kept the old token: no re-claim, heartbeats 404) (2026-07-02)
# 0.1.22: phonebook v3 (17-col, model_id + rated_power_w/rated_lumens/cct), floating book parses SRP rpw/rl/cct + reports them to convergence, operational book v3-only (v2/v1 reject), new GET /bos/<spatial_id>/* reverse proxy (2026-07-04)
# 0.1.23: torrent-lite BR distribution side - /mesh/have now carries a phonebook TARGET (version/digest/bytes) alongside the ledger target; new bos_mesh_announce fires a mesh-wide nudge (coap://[ff03::1]/mesh/announce) on a fresh phonebook ingest (POST /bos/phonebook) AND a fresh ledger deploy (POST /bos/ledger/push) so nodes pull now; phonebook PUSH preserved (additive) (2026-07-04)
CONFIG_APP_PROJECT_VER="0.1.23"

# HTTP server for upstream BR diagnostics and Building OS /bos/ endpoints.
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# OpenThread border-router role.
CONFIG_IEEE802154_ENABLED=n
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_BORDER_ROUTER=y
CONFIG_OPENTHREAD_FTD=y
CONFIG_OPENTHREAD_CLI=n
CONFIG_OPENTHREAD_CLI_ESP_EXTENSION=n
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_SRP_CLIENT_MAX_SERVICES=5
CONFIG_OPENTHREAD_NUM_MESSAGE_BUFFERS=128
CONFIG_OPENTHREAD_RCP_COMMAND=y
# Upstream auto-start (random network formed by examples/common ot_br_init)
# is replaced by the BOS bring-up task in main/app_main.c, which owns
# backbone connect, BR init, and the bos_thread_dataset_anchor dataset
# lifecycle (apply persisted dataset, else form once and persist).
CONFIG_OPENTHREAD_BR_AUTO_START=n
# OpenThread Commissioner role for docs/06.2 phase 2b joiner acceptance
# (POST /bos/joiner/accept). Already =y in sdkconfig; pinned here so
# regenerated configs keep it.
CONFIG_OPENTHREAD_COMMISSIONER=y
CONFIG_OPENTHREAD_BR_START_WEB=y
CONFIG_ESP_BR_WEB_WRITE_AUTH=y
CONFIG_ESP_BR_WEB_ADMIN_PASSWORD=""
CONFIG_BOS_SERVER_DEFAULT_URL="http://192.168.88.253:7085"
CONFIG_BOS_SERVER_API_KEY=""

# Border-router forwarding and service proxy capacity.
CONFIG_LWIP_IPV6_FORWARD=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=12
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_LWIP_HOOK_IP6_INPUT_CUSTOM=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_HOOK_IP6_SELECT_SRC_ADDR_CUSTOM=y
CONFIG_LWIP_FORCE_ROUTER_FORWARDING=y
CONFIG_MDNS_MULTIPLE_INSTANCE=y
CONFIG_MDNS_MAX_SERVICES=200

# H2 RCP over UART. Pin assignments come from the upstream esp-thread-br defaults
# for this main board.
CONFIG_OPENTHREAD_RADIO_NATIVE=n
CONFIG_OPENTHREAD_RADIO_SPINEL_UART=y
CONFIG_AUTO_UPDATE_RCP=y
CONFIG_RCP_PARTITION_NAME="rcp_fw"
CONFIG_RCP_PATH_NAME="rcp"
CONFIG_ESP_BR_BOARD_DEV_KIT=y
CONFIG_ESP_BR_H2_TARGET=y
CONFIG_PIN_TO_RCP_RESET=7
CONFIG_PIN_TO_RCP_BOOT=8
CONFIG_PIN_TO_RCP_TX=17
CONFIG_PIN_TO_RCP_RX=18

# W5500 Ethernet on the Sub-Ethernet daughter board.
# Pin map confirmed from Espressif Sub-Ethernet schematic v1.0.
CONFIG_EXAMPLE_CONNECT_WIFI=n
CONFIG_EXAMPLE_CONNECT_ETHERNET=y
CONFIG_EXAMPLE_CONNECT_IPV4=y
CONFIG_EXAMPLE_CONNECT_IPV6=y
CONFIG_EXAMPLE_USE_W5500=y
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y
CONFIG_EXAMPLE_ETH_SPI_HOST=2
CONFIG_EXAMPLE_ETH_SPI_SCLK_GPIO=21
CONFIG_EXAMPLE_ETH_SPI_MOSI_GPIO=45
CONFIG_EXAMPLE_ETH_SPI_MISO_GPIO=38
CONFIG_EXAMPLE_ETH_SPI_CS_GPIO=41
# Diagnostic margin (br-diagnosis.md finding #3): 36 MHz is known-issue
# territory for W5500+OTBR; run the stability test at 20 MHz.
CONFIG_EXAMPLE_ETH_SPI_CLOCK_MHZ=20
CONFIG_EXAMPLE_ETH_SPI_INT_GPIO=39
CONFIG_EXAMPLE_ETH_PHY_RST_GPIO=40
CONFIG_EXAMPLE_ETH_PHY_ADDR=1

# mbedtls for DTLS and TLS.
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_ECJPAKE_C=y
